blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Test"], ["body", "Testing article number 1"], ["created_at", "2024-04-23 09:08:14.810783"], ["updated_at", "2024-04-23 09:08:14.810783"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save