blog/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Isaac"], ["body", "Hello, testing comments"], ["article_id", 1], ["created_at", "2024-04-23 10:06:26.373557"], ["updated_at", "2024-04-23 10:06:26.373557"]]